In [2]:
import json
import pandas as pd
with open("C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/clientes (1).json") as f:
    clientes=json.load(f)

In [3]:
lista_clientes=[]
for t_id, datos in clientes.items():
    cliente = {
        't_id': t_id,
        'origen': datos['origen'],
        'destino': datos['destino']
    }
    lista_clientes.append(cliente)

In [4]:
df=pd.DataFrame(lista_clientes)

In [5]:
tipo=df.dtypes
tipo

t_id       object
origen     object
destino    object
dtype: object

In [6]:
df.head(12)

   t_id       origen      destino
0     0  C1231006815  M1979787155
1     1  C1666544295  M2044282225
2     2  C1305486145   C553264065
3     3   C840083671    C38997010
4     4  C2048537720  M1230701703
5     5    C90045638   M573487274
6     6   C154988899   M408069119
7     7  C1912850431   M633326333
8     8  C1265012928  M1176932104
9     9   C712410124   C195600860
10   10  C1900366749   C997608398
11   11   C249177573  M2096539129

In [7]:
df.shape

(6362620, 3)

In [8]:
df['t_id'] = df['t_id'].astype(int)

In [9]:
df.dtypes

t_id        int32
origen     object
destino    object
dtype: object

In [10]:
cliente=df['t_id']

In [11]:
clientes=pd.DataFrame(cliente)

In [12]:
clientes

            t_id
0              0
1              1
2              2
3              3
4              4
...          ...
6362615  6362615
6362616  6362616
6362617  6362617
6362618  6362618
6362619  6362619

[6362620 rows x 1 columns]

In [13]:
import json
import pandas as pd
with open("C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/tipo.json") as f:
    tipo=json.load(f)

In [14]:
lista_tipo = []
for clave, datos in tipo.items():
    for t_id in datos['t_id']:
        lista_tipo.append([t_id, datos['tipo']])

In [15]:
dft = pd.DataFrame(lista_tipo,columns=['t_id', 'tipo'])

In [16]:
dft

            t_id     tipo
0              0  PAYMENT
1              1  PAYMENT
2              4  PAYMENT
3              5  PAYMENT
4              6  PAYMENT
...          ...      ...
6362615  6362253  CASH_IN
6362616  6362271  CASH_IN
6362617  6362279  CASH_IN
6362618  6362298  CASH_IN
6362619  6362315  CASH_IN

[6362620 rows x 2 columns]

In [17]:
dft.isnull().sum()

t_id    0
tipo    0
dtype: int64

In [18]:
nuevo_df= clientes.merge(dft,left_on='t_id', right_on='t_id')

In [19]:
nuevo_df

            t_id      tipo
0              0   PAYMENT
1              1   PAYMENT
2              2  TRANSFER
3              3  CASH_OUT
4              4   PAYMENT
...          ...       ...
6362615  6362615  CASH_OUT
6362616  6362616  TRANSFER
6362617  6362617  CASH_OUT
6362618  6362618  TRANSFER
6362619  6362619  CASH_OUT

[6362620 rows x 2 columns]

In [20]:
nuevo_df.isnull().sum()

t_id    0
tipo    0
dtype: int64

In [21]:
import json
import pandas as pd
with open("C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/tiempo.json") as f:
    tiempo=json.load(f)

In [22]:
lista_tiempo = []
for clave in tiempo:
    for t_id in tiempo[clave]:
        lista_tiempo.append([clave, t_id])

In [23]:
d=pd.DataFrame(lista_tiempo,columns=['tiempo', 't_id'])

In [24]:
d

        tiempo     t_id
0            1        0
1            1        1
2            1        2
3            1        3
4            1        4
...        ...      ...
6362615    743  6362615
6362616    743  6362616
6362617    743  6362617
6362618    743  6362618
6362619    743  6362619

[6362620 rows x 2 columns]

In [25]:
d.dtypes

tiempo    object
t_id       int64
dtype: object

In [26]:
d['tiempo'] = d['tiempo'].astype(int)

In [27]:
d.dtypes

tiempo    int32
t_id      int64
dtype: object

# Creando tabla de tiempo

In [28]:
from datetime import datetime, timedelta
start_date = datetime(2022, 9, 1, 7)
dates=[]
for i in range(1,744):
    dates.append(start_date + timedelta(hours=i-1))
date=pd.DataFrame(dates,columns=['fecha y hora'])
date.index = [i+1 for i in range(len(date))]
datefinal=date.reset_index()

In [29]:
datefinal

     index        fecha y hora
0        1 2022-09-01 07:00:00
1        2 2022-09-01 08:00:00
2        3 2022-09-01 09:00:00
3        4 2022-09-01 10:00:00
4        5 2022-09-01 11:00:00
..     ...                 ...
738    739 2022-10-02 01:00:00
739    740 2022-10-02 02:00:00
740    741 2022-10-02 03:00:00
741    742 2022-10-02 04:00:00
742    743 2022-10-02 05:00:00

[743 rows x 2 columns]

In [30]:
nuevo_dataframe = d.merge(datefinal,left_on='tiempo', right_on='index')

In [31]:
nuevo_dataframe

         tiempo     t_id  index        fecha y hora
0             1        0      1 2022-09-01 07:00:00
1             1        1      1 2022-09-01 07:00:00
2             1        2      1 2022-09-01 07:00:00
3             1        3      1 2022-09-01 07:00:00
4             1        4      1 2022-09-01 07:00:00
...         ...      ...    ...                 ...
6362615     743  6362615    743 2022-10-02 05:00:00
6362616     743  6362616    743 2022-10-02 05:00:00
6362617     743  6362617    743 2022-10-02 05:00:00
6362618     743  6362618    743 2022-10-02 05:00:00
6362619     743  6362619    743 2022-10-02 05:00:00

[6362620 rows x 4 columns]

In [32]:
dfinal=nuevo_dataframe[['t_id', 'fecha y hora']]

In [33]:
dfinal

            t_id        fecha y hora
0              0 2022-09-01 07:00:00
1              1 2022-09-01 07:00:00
2              2 2022-09-01 07:00:00
3              3 2022-09-01 07:00:00
4              4 2022-09-01 07:00:00
...          ...                 ...
6362615  6362615 2022-10-02 05:00:00
6362616  6362616 2022-10-02 05:00:00
6362617  6362617 2022-10-02 05:00:00
6362618  6362618 2022-10-02 05:00:00
6362619  6362619 2022-10-02 05:00:00

[6362620 rows x 2 columns]

In [34]:
nuevo_df1= nuevo_df.merge(dfinal,left_on='t_id', right_on='t_id')

In [35]:
nuevo_df1

            t_id      tipo        fecha y hora
0              0   PAYMENT 2022-09-01 07:00:00
1              1   PAYMENT 2022-09-01 07:00:00
2              2  TRANSFER 2022-09-01 07:00:00
3              3  CASH_OUT 2022-09-01 07:00:00
4              4   PAYMENT 2022-09-01 07:00:00
...          ...       ...                 ...
6362615  6362615  CASH_OUT 2022-10-02 05:00:00
6362616  6362616  TRANSFER 2022-10-02 05:00:00
6362617  6362617  CASH_OUT 2022-10-02 05:00:00
6362618  6362618  TRANSFER 2022-10-02 05:00:00
6362619  6362619  CASH_OUT 2022-10-02 05:00:00

[6362620 rows x 3 columns]

# Tabla Final

In [36]:
import json
import pandas as pd
with open("C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/cuantiafinal.json") as f:
    cuantia=json.load(f)

In [37]:
lista_cuantia = []
for clave, valor in cuantia.items():
        cuantia = {
            't_id': clave,
            'monto': valor['cuantia']
        }
        lista_cuantia.append(cuantia)

In [38]:
lista_cuantia

[{'t_id': '0', 'monto': 9839.64},
 {'t_id': '1', 'monto': 1864.28},
 {'t_id': '2', 'monto': 181.0},
 {'t_id': '3', 'monto': 181.0},
 {'t_id': '4', 'monto': 11668.14},
 {'t_id': '5', 'monto': 7817.71},
 {'t_id': '6', 'monto': 7107.77},
 {'t_id': '7', 'monto': 7861.64},
 {'t_id': '8', 'monto': 4024.36},
 {'t_id': '9', 'monto': 5337.77},
 {'t_id': '10', 'monto': 9644.94},
 {'t_id': '11', 'monto': 3099.97},
 {'t_id': '12', 'monto': 2560.74},
 {'t_id': '13', 'monto': 11633.76},
 {'t_id': '14', 'monto': 4098.78},
 {'t_id': '15', 'monto': 229133.94},
 {'t_id': '16', 'monto': 1563.82},
 {'t_id': '17', 'monto': 1157.86},
 {'t_id': '18', 'monto': 671.64},
 {'t_id': '19', 'monto': 215310.3},
 {'t_id': '20', 'monto': 1373.43},
 {'t_id': '21', 'monto': 9302.79},
 {'t_id': '22', 'monto': 1065.41},
 {'t_id': '23', 'monto': 3876.41},
 {'t_id': '24', 'monto': 311685.89},
 {'t_id': '25', 'monto': 6061.13},
 {'t_id': '26', 'monto': 9478.39},
 {'t_id': '27', 'monto': 8009.09},
 {'t_id': '28', 'monto': 8901.99},
 {'t_id': '29', 'monto': 9920.52},
 {'t_id': '30', 'monto': 3448.92},
 {'t_id': '31', 'monto': 4206.84},
 {'t_id': '32', 'monto': 5885.56},
 {'t_id': '33', 'monto': 5307.88},
 {'t_id': '34', 'monto': 5031.22},
 {'t_id': '35', 'monto': 24213.67},
 {'t_id': '36', 'monto': 8603.42},
 {'t_id': '37', 'monto': 2791.42},
 {'t_id': '38', 'monto': 7413.54},
 {'t_id': '39', 'monto': 3295.19},
 {'t_id': '40', 'monto': 1684.81},
 {'t_id': '41', 'monto': 5758.59},
 {'t_id': '42', 'monto': 110414.71},
 {'t_id': '43', 'monto': 7823.46},
 {'t_id': '44', 'monto': 5086.48},
 {'t_id': '45', 'monto': 5281.48},
 {'t_id': '46', 'monto': 13875.98},
 {'t_id': '47', 'monto': 56953.9},
 {'t_id': '48', 'monto': 5346.89},
 {'t_id': '49', 'monto': 2204.04},
 {'t_id': '50', 'monto': 2641.47},
 {'t_id': '51', 'monto': 23261.3},
 {'t_id': '52', 'monto': 2330.64},
 {'t_id': '53', 'monto': 1614.64},
 {'t_id': '54', 'monto': 9164.71},
 {'t_id': '55', 'monto': 2970.97},
 {'t_id': '56', 'monto': 38.66},
 {'t_id': '57', 'monto': 2252.44},
 {'t_id': '58', 'monto': 62610.8},
 {'t_id': '59', 'monto': 5529.13},
 {'t_id': '60', 'monto': 82940.31},
 {'t_id': '61', 'monto': 4510.22},
 {'t_id': '62', 'monto': 8727.74},
 {'t_id': '63', 'monto': 2599.46},
 {'t_id': '64', 'monto': 4874.49},
 {'t_id': '65', 'monto': 6440.78},
 {'t_id': '66', 'monto': 4910.14},
 {'t_id': '67', 'monto': 6444.64},
 {'t_id': '68', 'monto': 5149.66},
 {'t_id': '69', 'monto': 7292.16},
 {'t_id': '70', 'monto': 47458.86},
 {'t_id': '71', 'monto': 136872.92},
 {'t_id': '72', 'monto': 94253.33},
 {'t_id': '73', 'monto': 2998.04},
 {'t_id': '74', 'monto': 3454.08},
 {'t_id': '75', 'monto': 4316.2},
 {'t_id': '76', 'monto': 2131.84},
 {'t_id': '77', 'monto': 12986.61},
 {'t_id': '78', 'monto': 42712.39},
 {'t_id': '79', 'monto': 77957.68},
 {'t_id': '80', 'monto': 17231.46},
 {'t_id': '81', 'monto': 78766.03},
 {'t_id': '82', 'monto': 224606.64},
 {'t_id': '83', 'monto': 125872.53},
 {'t_id': '84', 'monto': 379856.23},
 {'t_id': '85', 'monto': 1505626.01},
 {'t_id': '86', 'monto': 554026.99},
 {'t_id': '87', 'monto': 147543.1},
 {'t_id': '88', 'monto': 761507.39},
 {'t_id': '89', 'monto': 1429051.47},
 {'t_id': '90', 'monto': 358831.92},
 {'t_id': '91', 'monto': 367768.4},
 {'t_id': '92', 'monto': 209711.11},
 {'t_id': '93', 'monto': 583848.46},
 {'t_id': '94', 'monto': 1724887.05},
 {'t_id': '95', 'monto': 710544.77},
 {'t_id': '96', 'monto': 581294.26},
 {'t_id': '97', 'monto': 11996.58},
 {'t_id': '98', 'monto': 2875.1},
 {'t_id': '99', 'monto': 8586.98},
 {'t_id': '100', 'monto': 871.75},
 {'t_id': '101', 'monto': 1035.36},
 {'t_id': '102', 'monto': 1063.53},
 {'t_id': '103', 'monto': 1019.9},
 {'t_id': '104', 'monto': 4059.38},
 {'t_id': '105', 'monto': 1876.44},
 {'t_id': '106', 'monto': 28404.6},
 {'t_id': '107', 'monto': 75405.1},
 {'t_id': '108', 'monto': 50101.88},
 {'t_id': '109', 'monto': 14121.82},
 {'t_id': '110', 'monto': 78292.91},
 {'t_id': '111', 'monto': 176149.9},
 {'t_id': '112', 'monto': 212228.35},
 {'t_id': '113', 'monto': 85423.63},
 {'t_id': '114', 'monto': 11648.5},
 {'t_id': '115', 'monto': 6165.58},
 {'t_id': '116', 'monto': 3705.83},
 {'t_id': '117', 'monto': 419801.4},
 {'t_id': '118', 'monto': 335416.51},
 {'t_id': '119', 'monto': 3372.29},
 {'t_id': '120', 'monto': 661.43},
 {'t_id': '121', 'monto': 864.68},
 {'t_id': '122', 'monto': 1203.44},
 {'t_id': '123', 'monto': 330757.04},
 {'t_id': '124', 'monto': 1915.43},
 {'t_id': '125', 'monto': 8.73},
 {'t_id': '126', 'monto': 3058.8},
 {'t_id': '127', 'monto': 5154.97},
 {'t_id': '128', 'monto': 5213.25},
 {'t_id': '129', 'monto': 5392.75},
 {'t_id': '130', 'monto': 25.12},
 {'t_id': '131', 'monto': 17150.89},
 {'t_id': '132', 'monto': 679502.24},
 {'t_id': '133', 'monto': 177652.91},
 {'t_id': '134', 'monto': 5443.26},
 {'t_id': '135', 'monto': 244.87},
 {'t_id': '136', 'monto': 8281.57},
 {'t_id': '137', 'monto': 1175.59},
 {'t_id': '138', 'monto': 1097.74},
 {'t_id': '139', 'monto': 184986.8},
 {'t_id': '140', 'monto': 1718.29},
 {'t_id': '141', 'monto': 3671.32},
 {'t_id': '142', 'monto': 3580.26},
 {'t_id': '143', 'monto': 8550.9},
 {'t_id': '144', 'monto': 9753.55},
 {'t_id': '145', 'monto': 3026.98},
 {'t_id': '146', 'monto': 467177.03},
 {'t_id': '147', 'monto': 3875.99},
 {'t_id': '148', 'monto': 2148.89},
 {'t_id': '149', 'monto': 466.97},
 {'t_id': '150', 'monto': 154139.72},
 {'t_id': '151', 'monto': 82685.93},
 {'t_id': '152', 'monto': 83857.23},
 {'t_id': '153', 'monto': 99109.77},
 {'t_id': '154', 'monto': 187726.67},
 {'t_id': '155', 'monto': 281339.92},
 {'t_id': '156', 'monto': 186447.51},
 {'t_id': '157', 'monto': 81029.86},
 {'t_id': '158', 'monto': 139054.95},
 {'t_id': '159', 'monto': 154716.2},
 {'t_id': '160', 'monto': 53631.83},
 {'t_id': '161', 'monto': 289645.52},
 {'t_id': '162', 'monto': 267148.82},
 {'t_id': '163', 'monto': 47913.58},
 {'t_id': '164', 'monto': 193605.38},
 {'t_id': '165', 'monto': 344464.4},
 {'t_id': '166', 'monto': 169409.87},
 {'t_id': '167', 'monto': 25793.74},
 {'t_id': '168', 'monto': 114712.48},
 {'t_id': '169', 'monto': 89038.75},
 {'t_id': '170', 'monto': 1341.58},
 {'t_id': '171', 'monto': 44443.08},
 {'t_id': '172', 'monto': 34729.64},
 {'t_id': '173', 'monto': 105979.34},
 {'t_id': '174', 'monto': 57794.61},
 {'t_id': '175', 'monto': 15918.79},
 {'t_id': '176', 'monto': 19162.08},
 {'t_id': '177', 'monto': 220691.42},
 {'t_id': '178', 'monto': 9536.54},
 {'t_id': '179', 'monto': 29784.06},
 {'t_id': '180', 'monto': 190445.51},
 {'t_id': '181', 'monto': 57279.11},
 {'t_id': '182', 'monto': 112086.81},
 {'t_id': '183', 'monto': 80311.89},
 {'t_id': '184', 'monto': 151829.91},
 {'t_id': '185', 'monto': 26004.52},
 {'t_id': '186', 'monto': 3146.16},
 {'t_id': '187', 'monto': 296752.75},
 {'t_id': '188', 'monto': 191702.06},
 {'t_id': '189', 'monto': 365510.05},
 {'t_id': '190', 'monto': 202332.08},
 {'t_id': '191', 'monto': 55105.9},
 {'t_id': '192', 'monto': 171508.59},
 {'t_id': '193', 'monto': 178439.26},
 {'t_id': '194', 'monto': 88834.86},
 {'t_id': '195', 'monto': 210370.09},
 {'t_id': '196', 'monto': 36437.06},
 {'t_id': '197', 'monto': 82691.56},
 {'t_id': '198', 'monto': 338767.1},
 {'t_id': '199', 'monto': 187728.59},
 {'t_id': '200', 'monto': 271002.7},
 {'t_id': '201', 'monto': 323105.08},
 {'t_id': '202', 'monto': 10782.94},
 {'t_id': '203', 'monto': 89962.11},
 {'t_id': '204', 'monto': 101940.14},
 {'t_id': '205', 'monto': 163100.34},
 {'t_id': '206', 'monto': 136030.66},
 {'t_id': '207', 'monto': 68912.23},
 {'t_id': '208', 'monto': 73464.06},
 {'t_id': '209', 'monto': 106117.28},
 {'t_id': '210', 'monto': 503333.79},
 {'t_id': '211', 'monto': 71991.42},
 {'t_id': '212', 'monto': 91379.93},
 {'t_id': '213', 'monto': 26759.05},
 {'t_id': '214', 'monto': 128487.35},
 {'t_id': '215', 'monto': 252908.87},
 {'t_id': '216', 'monto': 64489.64},
 {'t_id': '217', 'monto': 171369.73},
 {'t_id': '218', 'monto': 4493.29},
 {'t_id': '219', 'monto': 12121.5},
 {'t_id': '220', 'monto': 2278.19},
 {'t_id': '221', 'monto': 7707.44},
 {'t_id': '222', 'monto': 4013.02},
 {'t_id': '223', 'monto': 5775.15},
 {'t_id': '224', 'monto': 4843.93},
 {'t_id': '225', 'monto': 2397.82},
 {'t_id': '226', 'monto': 4391.44},
 {'t_id': '227', 'monto': 4497.87},
 {'t_id': '228', 'monto': 7452.89},
 {'t_id': '229', 'monto': 3930.81},
 {'t_id': '230', 'monto': 71532.24},
 {'t_id': '231', 'monto': 61159.51},
 {'t_id': '232', 'monto': 12401.9},
 {'t_id': '233', 'monto': 32702.61},
 {'t_id': '234', 'monto': 6926.67},
 {'t_id': '235', 'monto': 893.57},
 {'t_id': '236', 'monto': 480222.51},
 {'t_id': '237', 'monto': 3608.41},
 {'t_id': '238', 'monto': 5946.79},
 {'t_id': '239', 'monto': 6099.96},
 {'t_id': '240', 'monto': 372.34},
 {'t_id': '241', 'monto': 4635.18},
 {'t_id': '242', 'monto': 1267.97},
 {'t_id': '243', 'monto': 6911.99},
 {'t_id': '244', 'monto': 1795.67},
 {'t_id': '245', 'monto': 3199.06},
 {'t_id': '246', 'monto': 10265.17},
 {'t_id': '247', 'monto': 9029.12},
 {'t_id': '248', 'monto': 7600.57},
 {'t_id': '249', 'monto': 2057.71},
 {'t_id': '250', 'monto': 3823.08},
 {'t_id': '251', 'monto': 2806.0},
 {'t_id': '252', 'monto': 2806.0},
 {'t_id': '253', 'monto': 6737.2},
 {'t_id': '254', 'monto': 9161.98},
 {'t_id': '255', 'monto': 1239.06},
 {'t_id': '256', 'monto': 365.0},
 {'t_id': '257', 'monto': 5237.54},
 {'t_id': '258', 'monto': 2618.76},
 {'t_id': '259', 'monto': 339.82},
 {'t_id': '260', 'monto': 1393.46},
 {'t_id': '261', 'monto': 2731.37},
 {'t_id': '262', 'monto': 8364.73},
 {'t_id': '263', 'monto': 6598.71},
 {'t_id': '264', 'monto': 4304.58},
 {'t_id': '265', 'monto': 2867.14},
 {'t_id': '266', 'monto': 2946.38},
 {'t_id': '267', 'monto': 507.12},
 {'t_id': '268', 'monto': 3020.86},
 {'t_id': '269', 'monto': 8948.03},
 {'t_id': '270', 'monto': 280877.92},
 {'t_id': '271', 'monto': 1084.9},
 {'t_id': '272', 'monto': 9456.69},
 {'t_id': '273', 'monto': 5812.36},
 {'t_id': '274', 'monto': 157883.07},
 {'t_id': '275', 'monto': 2734.77},
 {'t_id': '276', 'monto': 102153.86},
 {'t_id': '277', 'monto': 584.52},
 {'t_id': '278', 'monto': 6113.14},
 {'t_id': '279', 'monto': 369989.2},
 {'t_id': '280', 'monto': 215338.28},
 {'t_id': '281', 'monto': 65521.42},
 {'t_id': '282', 'monto': 116977.58},
 {'t_id': '283', 'monto': 262392.36},
 {'t_id': '284', 'monto': 51121.05},
 {'t_id': '285', 'monto': 202624.59},
 {'t_id': '286', 'monto': 118235.16},
 {'t_id': '287', 'monto': 118056.71},
 {'t_id': '288', 'monto': 498960.91},
 {'t_id': '289', 'monto': 691738.36},
 {'t_id': '290', 'monto': 58820.08},
 {'t_id': '291', 'monto': 4419.04},
 {'t_id': '292', 'monto': 4270.02},
 {'t_id': '293', 'monto': 3007.83},
 {'t_id': '294', 'monto': 1824.59},
 {'t_id': '295', 'monto': 993.46},
 {'t_id': '296', 'monto': 302693.14},
 {'t_id': '297', 'monto': 1445.06},
 {'t_id': '298', 'monto': 4059.25},
 {'t_id': '299', 'monto': 3417.18},
 {'t_id': '300', 'monto': 3428.95},
 {'t_id': '301', 'monto': 5580.98},
 {'t_id': '302', 'monto': 3455.85},
 {'t_id': '303', 'monto': 7265.63},
 {'t_id': '304', 'monto': 3852.64},
 {'t_id': '305', 'monto': 7870.29},
 {'t_id': '306', 'monto': 12872.92},
 {'t_id': '307', 'monto': 6675.34},
 {'t_id': '308', 'monto': 410201.89},
 {'t_id': '309', 'monto': 13310.78},
 {'t_id': '310', 'monto': 664.35},
 {'t_id': '311', 'monto': 2130.3},
 {'t_id': '312', 'monto': 7771.4},
 {'t_id': '313', 'monto': 36349.35},
 {'t_id': '314', 'monto': 749.34},
 {'t_id': '315', 'monto': 2340.34},
 {'t_id': '316', 'monto': 9686.85},
 {'t_id': '317', 'monto': 15785.85},
 {'t_id': '318', 'monto': 9006.78},
 {'t_id': '319', 'monto': 9014.95},
 {'t_id': '320', 'monto': 14420.66},
 {'t_id': '321', 'monto': 4802.31},
 {'t_id': '322', 'monto': 28527.44},
 {'t_id': '323', 'monto': 4182.93},
 {'t_id': '324', 'monto': 4088.21},
 {'t_id': '325', 'monto': 8491.9},
 {'t_id': '326', 'monto': 6666.78},
 {'t_id': '327', 'monto': 6536.86},
 {'t_id': '328', 'monto': 40684.97},
 {'t_id': '329', 'monto': 1553.21},
 {'t_id': '330', 'monto': 7344.92},
 {'t_id': '331', 'monto': 106267.21},
 {'t_id': '332', 'monto': 5491.5},
 {'t_id': '333', 'monto': 3666.42},
 {'t_id': '334', 'monto': 5507.18},
 {'t_id': '335', 'monto': 4565.14},
 {'t_id': '336', 'monto': 11348.71},
 {'t_id': '337', 'monto': 123179.97},
 {'t_id': '338', 'monto': 7073.6},
 {'t_id': '339', 'monto': 2803.83},
 {'t_id': '340', 'monto': 106.81},
 {'t_id': '341', 'monto': 6297.71},
 {'t_id': '342', 'monto': 2610.01},
 {'t_id': '343', 'monto': 5320.1},
 {'t_id': '344', 'monto': 1460.63},
 {'t_id': '345', 'monto': 522264.81},
 {'t_id': '346', 'monto': 3584.21},
 {'t_id': '347', 'monto': 3704.97},
 {'t_id': '348', 'monto': 2773.61},
 {'t_id': '349', 'monto': 3896.42},
 {'t_id': '350', 'monto': 18781.84},
 {'t_id': '351', 'monto': 6660.33},
 {'t_id': '352', 'monto': 26923.42},
 {'t_id': '353', 'monto': 53783.57},
 {'t_id': '354', 'monto': 80333.28},
 {'t_id': '355', 'monto': 211075.91},
 {'t_id': '356', 'monto': 100677.86},
 {'t_id': '357', 'monto': 473499.51},
 {'t_id': '358', 'monto': 1538200.39},
 {'t_id': '359', 'monto': 2421578.09},
 {'t_id': '360', 'monto': 1349670.68},
 {'t_id': '361', 'monto': 314403.14},
 {'t_id': '362', 'monto': 1457213.54},
 {'t_id': '363', 'monto': 180368.84},
 {'t_id': '364', 'monto': 445038.71},
 {'t_id': '365', 'monto': 1123206.66},
 {'t_id': '366', 'monto': 996.0},
 {'t_id': '367', 'monto': 176334.26},
 {'t_id': '368', 'monto': 161217.61},
 {'t_id': '369', 'monto': 108443.61},
 {'t_id': '370', 'monto': 75442.68},
 {'t_id': '371', 'monto': 55536.86},
 {'t_id': '372', 'monto': 438437.09},
 {'t_id': '373', 'monto': 928722.69},
 {'t_id': '374', 'monto': 1478772.04},
 {'t_id': '375', 'monto': 2545478.01},
 {'t_id': '376', 'monto': 2061082.82},
 {'t_id': '377', 'monto': 983479.66},
 {'t_id': '378', 'monto': 635507.97},
 {'t_id': '379', 'monto': 848231.57},
 {'t_id': '380', 'monto': 739112.93},
 {'t_id': '381', 'monto': 324397.94},
 {'t_id': '382', 'monto': 982862.81},
 {'t_id': '383', 'monto': 955855.0},
 {'t_id': '384', 'monto': 179253.24},
 {'t_id': '385', 'monto': 5446.88},
 {'t_id': '386', 'monto': 648.64},
 {'t_id': '387', 'monto': 8494.71},
 {'t_id': '388', 'monto': 373068.26},
 {'t_id': '389', 'monto': 143236.26},
 {'t_id': '390', 'monto': 228451.89},
 {'t_id': '391', 'monto': 35902.49},
 {'t_id': '392', 'monto': 232953.64},
 {'t_id': '393', 'monto': 65912.95},
 {'t_id': '394', 'monto': 193492.68},
 {'t_id': '395', 'monto': 60836.64},
 {'t_id': '396', 'monto': 62325.15},
 {'t_id': '397', 'monto': 349640.51},
 {'t_id': '398', 'monto': 135324.19},
 {'t_id': '399', 'monto': 380015.14},
 {'t_id': '400', 'monto': 418688.27},
 {'t_id': '401', 'monto': 311023.52},
 {'t_id': '402', 'monto': 151862.38},
 {'t_id': '403', 'monto': 228710.05},
 {'t_id': '404', 'monto': 220431.09},
 {'t_id': '405', 'monto': 182861.45},
 {'t_id': '406', 'monto': 231881.5},
 {'t_id': '407', 'monto': 38071.17},
 {'t_id': '408', 'monto': 87117.29},
 {'t_id': '409', 'monto': 114271.72},
 {'t_id': '410', 'monto': 73199.1},
 {'t_id': '411', 'monto': 764772.98},
 {'t_id': '412', 'monto': 106847.36},
 {'t_id': '413', 'monto': 6287.28},
 {'t_id': '414', 'monto': 24936.34},
 {'t_id': '415', 'monto': 55837.16},
 {'t_id': '416', 'monto': 63255.29},
 {'t_id': '417', 'monto': 104605.78},
 {'t_id': '418', 'monto': 154160.82},
 {'t_id': '419', 'monto': 257348.03},
 {'t_id': '420', 'monto': 201073.81},
 {'t_id': '421', 'monto': 53560.68},
 {'t_id': '422', 'monto': 334234.39},
 {'t_id': '423', 'monto': 227335.16},
 {'t_id': '424', 'monto': 134426.08},
 {'t_id': '425', 'monto': 2643.45},
 {'t_id': '426', 'monto': 134977.11},
 {'t_id': '427', 'monto': 25090.03},
 {'t_id': '428', 'monto': 147388.67},
 {'t_id': '429', 'monto': 217615.09},
 {'t_id': '430', 'monto': 355294.5},
 {'t_id': '431', 'monto': 12336.48},
 {'t_id': '432', 'monto': 349505.89},
 {'t_id': '433', 'monto': 285185.34},
 {'t_id': '434', 'monto': 132953.45},
 {'t_id': '435', 'monto': 214851.41},
 {'t_id': '436', 'monto': 54988.56},
 {'t_id': '437', 'monto': 62871.06},
 {'t_id': '438', 'monto': 61150.85},
 {'t_id': '439', 'monto': 131409.27},
 {'t_id': '440', 'monto': 10844.33},
 {'t_id': '441', 'monto': 2054.84},
 {'t_id': '442', 'monto': 313373.56},
 {'t_id': '443', 'monto': 13289.87},
 {'t_id': '444', 'monto': 27070.11},
 {'t_id': '445', 'monto': 127954.7},
 {'t_id': '446', 'monto': 197031.04},
 {'t_id': '447', 'monto': 144366.64},
 {'t_id': '448', 'monto': 7965.49},
 {'t_id': '449', 'monto': 123103.74},
 {'t_id': '450', 'monto': 106634.77},
 {'t_id': '451', 'monto': 74933.22},
 {'t_id': '452', 'monto': 120234.99},
 {'t_id': '453', 'monto': 5763.99},
 {'t_id': '454', 'monto': 156922.36},
 {'t_id': '455', 'monto': 162665.98},
 {'t_id': '456', 'monto': 110226.34},
 {'t_id': '457', 'monto': 142577.44},
 {'t_id': '458', 'monto': 6915.38},
 {'t_id': '459', 'monto': 157108.01},
 {'t_id': '460', 'monto': 223555.14},
 {'t_id': '461', 'monto': 146331.12},
 {'t_id': '462', 'monto': 141131.23},
 {'t_id': '463', 'monto': 222711.47},
 {'t_id': '464', 'monto': 84980.31},
 {'t_id': '465', 'monto': 628719.07},
 {'t_id': '466', 'monto': 79285.8},
 {'t_id': '467', 'monto': 57809.81},
 {'t_id': '468', 'monto': 75043.17},
 {'t_id': '469', 'monto': 248196.92},
 {'t_id': '470', 'monto': 18851.44},
 {'t_id': '471', 'monto': 403418.39},
 {'t_id': '472', 'monto': 235564.81},
 {'t_id': '473', 'monto': 32325.24},
 {'t_id': '474', 'monto': 345347.7},
 {'t_id': '475', 'monto': 355500.25},
 {'t_id': '476', 'monto': 103005.78},
 {'t_id': '477', 'monto': 108803.98},
 {'t_id': '478', 'monto': 259753.27},
 {'t_id': '479', 'monto': 234094.24},
 {'t_id': '480', 'monto': 273305.73},
 {'t_id': '481', 'monto': 186838.95},
 {'t_id': '482', 'monto': 193161.04},
 {'t_id': '483', 'monto': 152823.85},
 {'t_id': '484', 'monto': 91457.82},
 {'t_id': '485', 'monto': 277807.48},
 {'t_id': '486', 'monto': 8679.13},
 {'t_id': '487', 'monto': 2099.59},
 {'t_id': '488', 'monto': 221693.08},
 {'t_id': '489', 'monto': 206097.65},
 {'t_id': '490', 'monto': 22384.21},
 {'t_id': '491', 'monto': 73210.99},
 {'t_id': '492', 'monto': 236747.6},
 {'t_id': '493', 'monto': 6284.18},
 {'t_id': '494', 'monto': 100198.77},
 {'t_id': '495', 'monto': 160347.32},
 {'t_id': '496', 'monto': 289272.75},
 {'t_id': '497', 'monto': 63189.26},
 {'t_id': '498', 'monto': 196725.32},
 {'t_id': '499', 'monto': 5882.32},
 {'t_id': '500', 'monto': 625.92},
 {'t_id': '501', 'monto': 5937.72},
 {'t_id': '502', 'monto': 9796.29},
 {'t_id': '503', 'monto': 13449.95},
 {'t_id': '504', 'monto': 4749.6},
 {'t_id': '505', 'monto': 6460.86},
 {'t_id': '506', 'monto': 3605.26},
 {'t_id': '507', 'monto': 624.61},
 {'t_id': '508', 'monto': 3854.92},
 {'t_id': '509', 'monto': 420532.33},
 {'t_id': '510', 'monto': 4402.86},
 {'t_id': '511', 'monto': 147804.02},
 {'t_id': '512', 'monto': 151.2},
 {'t_id': '513', 'monto': 58.21},
 {'t_id': '514', 'monto': 5936.82},
 {'t_id': '515', 'monto': 145944.67},
 {'t_id': '516', 'monto': 7206.33},
 {'t_id': '517', 'monto': 5581.55},
 {'t_id': '518', 'monto': 5853.21},
 {'t_id': '519', 'monto': 2528.1},
 {'t_id': '520', 'monto': 5655.17},
 {'t_id': '521', 'monto': 1456.09},
 {'t_id': '522', 'monto': 4252.82},
 {'t_id': '523', 'monto': 276460.62},
 {'t_id': '524', 'monto': 8811.67},
 {'t_id': '525', 'monto': 12666.68},
 {'t_id': '526', 'monto': 95636.49},
 {'t_id': '527', 'monto': 195314.34},
 {'t_id': '528', 'monto': 6049.09},
 {'t_id': '529', 'monto': 14306.8},
 {'t_id': '530', 'monto': 1117.34},
 {'t_id': '531', 'monto': 3179.7},
 {'t_id': '532', 'monto': 2880.68},
 {'t_id': '533', 'monto': 3060.54},
 {'t_id': '534', 'monto': 879.42},
 {'t_id': '535', 'monto': 3486.78},
 {'t_id': '536', 'monto': 21530.96},
 {'t_id': '537', 'monto': 2426.31},
 {'t_id': '538', 'monto': 5110.1},
 {'t_id': '539', 'monto': 207.75},
 {'t_id': '540', 'monto': 18437.04},
 {'t_id': '541', 'monto': 8690.69},
 {'t_id': '542', 'monto': 4946.03},
 {'t_id': '543', 'monto': 5432.09},
 {'t_id': '544', 'monto': 7649.41},
 {'t_id': '545', 'monto': 3943.17},
 {'t_id': '546', 'monto': 3101.33},

In [39]:
dfc=pd.DataFrame(lista_cuantia)

In [40]:
dfc.isnull().sum()

t_id     0
monto    0
dtype: int64

In [41]:
dfc

            t_id       monto
0              0     9839.64
1              1     1864.28
2              2      181.00
3              3      181.00
4              4    11668.14
...          ...         ...
6362615  6362615   339682.13
6362616  6362616  6311409.28
6362617  6362617  6311409.28
6362618  6362618   850002.52
6362619  6362619   850002.52

[6362620 rows x 2 columns]

In [42]:
dfc.dtypes

t_id      object
monto    float64
dtype: object

In [43]:
dfc['t_id'] = dfc['t_id'].astype(int)

In [44]:
dfc.dtypes

t_id       int32
monto    float64
dtype: object

In [45]:
transacciones= nuevo_df1.merge(dfc,left_on='t_id', right_on='t_id')

In [46]:
transacciones

            t_id      tipo        fecha y hora       monto
0              0   PAYMENT 2022-09-01 07:00:00     9839.64
1              1   PAYMENT 2022-09-01 07:00:00     1864.28
2              2  TRANSFER 2022-09-01 07:00:00      181.00
3              3  CASH_OUT 2022-09-01 07:00:00      181.00
4              4   PAYMENT 2022-09-01 07:00:00    11668.14
...          ...       ...                 ...         ...
6362615  6362615  CASH_OUT 2022-10-02 05:00:00   339682.13
6362616  6362616  TRANSFER 2022-10-02 05:00:00  6311409.28
6362617  6362617  CASH_OUT 2022-10-02 05:00:00  6311409.28
6362618  6362618  TRANSFER 2022-10-02 05:00:00   850002.52
6362619  6362619  CASH_OUT 2022-10-02 05:00:00   850002.52

[6362620 rows x 4 columns]

In [47]:
transacciones.sample(10)

            t_id      tipo        fecha y hora       monto
715385    715385   PAYMENT 2022-09-02 19:00:00     1498.07
4059688  4059688  CASH_OUT 2022-09-13 18:00:00   130771.24
5602145  5602145   PAYMENT 2022-09-17 16:00:00      557.10
3599577  3599577   PAYMENT 2022-09-12 05:00:00     4801.18
5529201  5529201   CASH_IN 2022-09-17 03:00:00    22313.19
6253419  6253419   PAYMENT 2022-09-26 02:00:00     5001.68
4452222  4452222  TRANSFER 2022-09-14 17:00:00  6302996.27
203332    203332   CASH_IN 2022-09-01 19:00:00    22957.64
1039128  1039128   PAYMENT 2022-09-05 04:00:00     1962.97
4467902  4467902   CASH_IN 2022-09-14 18:00:00   191699.64

In [48]:
transacciones= transacciones.rename(columns={'fecha y hora': 'tiempo'})

In [49]:
transacciones

            t_id      tipo              tiempo       monto
0              0   PAYMENT 2022-09-01 07:00:00     9839.64
1              1   PAYMENT 2022-09-01 07:00:00     1864.28
2              2  TRANSFER 2022-09-01 07:00:00      181.00
3              3  CASH_OUT 2022-09-01 07:00:00      181.00
4              4   PAYMENT 2022-09-01 07:00:00    11668.14
...          ...       ...                 ...         ...
6362615  6362615  CASH_OUT 2022-10-02 05:00:00   339682.13
6362616  6362616  TRANSFER 2022-10-02 05:00:00  6311409.28
6362617  6362617  CASH_OUT 2022-10-02 05:00:00  6311409.28
6362618  6362618  TRANSFER 2022-10-02 05:00:00   850002.52
6362619  6362619  CASH_OUT 2022-10-02 05:00:00   850002.52

[6362620 rows x 4 columns]

In [50]:
transacciones.to_csv('C:/Users/maria/OneDrive/Escritorio/pontia/Proyecto/transacciones.csv', sep='|', index=False)

In [51]:
transacciones.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6362620 entries, 0 to 6362619
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   t_id    int32
 1   tipo    object
 2   tiempo  datetime64[ns]
 3   monto   float64
dtypes: datetime64[ns](1), float64(1), int32(1), object(1)
memory usage: 218.4+ MB